Revit 2024 API
InitialLuminousIntensity Members
The InitialLuminousIntensity type exposes the following members.
Constructors
Name | Description
InitialLuminousIntensity(Double)
 Creates an initial luminous intensity object with the given document and luminosity values.
InitialLuminousIntensity(InitialLuminousIntensity)
 Creates a copy of the given initial luminous intensity object
Methods
Name | Description
Clone
 Creates a copy of the InitialIntensity derived object.
 (Inherited from InitialIntensity.)
Dispose |  (Inherited from InitialIntensity.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
InitialIntensityValue
 The calculated initial intensity value.
 (Inherited from InitialIntensity.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from InitialIntensity.)
Luminosity
 The luminosity value.
See Also
InitialLuminousIntensity Class
Autodesk.Revit.DB.Lighting Namespace